Revit 2020 API
Form.ConstrainProfiles Method
Constrain form profiles using the specified profile as master. This is an advanced version of property "AreProfilesConstrained", allowing specify the master profile.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 20.0.0.0 (20.0.0.377)
Syntax
C#
public void ConstrainProfiles(
	int masterProfileIndex
)
Visual Basic
Public Sub ConstrainProfiles ( _
	masterProfileIndex As Integer _
)
Visual C++
public:
void ConstrainProfiles(
	int masterProfileIndex
)
Parameters
masterProfileIndex
Type: System.Int32
Index to specify the profile used as master profile.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  This operation can only be performed on a swept blend form.
See Also
Form Class
Autodesk.Revit.DB Namespace